#!/usr/bin/env python
# -*- coding: utf-8 -*-

a = ('乙晓光','丁来杭','丁学东','丁薛祥','于伟国','于忠福','万立骏','习近平','马飚（壮族）','马兴瑞','王宁（武警）','王军','王勇','王晨','王毅','王小洪','王玉普','王正伟（回族）','王东明','王东峰','王尔乘','王志民','王志刚','王沪宁','王国生','王建军','王建武','王晓东','王晓晖','王家胜','王蒙徽','尤权','车俊','尹力','巴音朝鲁（蒙古族）','巴特尔（蒙古族）','艾力更·依明巴海（维吾尔族）','石泰峰','布小林（女，蒙古族）','卢展工','白春礼（满族）','吉炳轩','毕井泉','曲青山','朱生岭','刘奇','刘雷','刘鹤','刘士余','刘万龙','刘奇葆','刘国中','刘国治','刘金国','刘结一','刘振立','刘家义','刘赐贵','刘粤军','齐扎拉（藏族）','安兆庆（锡伯族）','许勤','许又声','许达哲','许其亮','阮成发','孙志刚','孙金龙','孙绍骋','孙春兰（女）','杜家毫','李屹','李希','李斌（女，国家机关）','李强','李干杰','李小鹏','李凤彪','李玉赋','李传广','李纪恒','李克强','李作成','李尚福','李国英','李桥铭','李晓红','李鸿忠','李锦斌','杨学军','杨洁篪','杨振武','杨晓渡','肖捷','肖亚庆','吴社洲','吴英杰','吴政隆','邱学强','何平（解放军）','何立峰','应勇','冷溶','汪洋','汪永清','沈金龙','沈晓明','沈跃跃（女）','沈德咏','怀进鹏','宋丹','宋涛','宋秀岩（女）','张军（国家机关）','张又侠','张升民','张庆伟','张庆黎','张纪南','张国清','张春贤','张晓明','张裔炯','陆昊','陈希','陈武（壮族）','陈豪','陈文清','陈吉宁','陈全国','陈求发（苗族）','陈宝生','陈润儿','陈敏尔','努尔兰·阿不都满金（哈萨克族）','苗圩','苗华','苟仲文','范骁骏','林铎','尚宏','金壮龙','周强','周亚宁','郑和','郑卫平','郑晓松','孟祥锋','赵乐际','赵克志','赵宗岐','郝鹏','胡和平','胡泽君（女）','胡春华','咸辉（女，回族）','钟山','信春鹰（女）','侯建国','娄勤俭','洛桑江村（藏族）','骆惠宁','秦生祥','袁家军','袁誉柏','袁曙宏','聂辰席','栗战书','钱小芊','铁凝（女）','倪岳峰','徐麟','徐乐江','徐安祥','高津','郭声琨','郭树清','唐仁健','黄明','黄守宏','黄坤明','黄树贤','曹建明','龚正','盛斌','雪克来提·扎克尔（维吾尔族）','鄂竟平','鹿心社','谌贻琴（女，白族）','彭清华','蒋超良','韩正','韩卫国','韩长赋','傅政华','谢伏瞻','楼阳生','蔡奇','蔡名照','雒树刚','黎火辉','潘立刚','穆虹','魏凤和')
b = ('丁兴农','马奔','王东海','王立山','王成蔚','王兴宁','王希明','王拥军','王荣军','王宾宜','王常松','王鸿津','王雁飞','方北群','方荣堂','邓卫平','邓中华','邓修明','艾俊涛','卢希（女）','田野','田静','白吕','白少康','冯志礼','朱国贤','朱国标','任正晓','任建华','刘昆','刘实','刘建','刘惠','刘化龙','刘文军','刘奇凡','刘昌林','刘金国','刘学新','刘建超','刘海泉','刘德伟','江金权','许传智','许罗德','孙斌','孙也刚','孙怀新','孙新阳','苏德良','李书磊','李仰哲','李欣然（满族）','李宝善','李建明','李清杰','杨宇栋','杨晓超','杨晓渡','肖培','吴志铭','吴海英（女）','吴清海','吴道槐','何平（中直机关）','邹加怡（女）','库热西·买合苏提（维吾尔族）','辛维光','汪利平','汪鸿雁','沈晓晖','宋鸿喜','宋福龙','迟耀云','张军（北京）','张敏（女）','张骥','张升民','张务锋','张春生','张硕辅','陆俊华','陈雍（满族）','陈小江','陈国猛','陈学斌','陈超英','陈辐宽','邵峰','林国耀','罗东川','周亮','周小莹（女）','郑国光','郑振涛','房灵敏','房建孟','赵乐际','赵惠令','侯凯','施克辉','姜信治','贺荣（女）','骆源','耿文清','贾育林','夏红民','徐令义','徐加爱','凌激','郭开朗','陶治国','龚堂华','崔鹏','章建华','梁惠玲（女）','蒋卓庆','蒋洪军','喻红秋（女）','傅奎','舒国增','曾益新','谢杭生','谢新义','蓝佛安','蒲增繁','蔡永中（黎族）','廖国勋（土家族）','廖建宇','滕佳材','潘盛洲','穆红玉（女）','戴均良');

a = set(a)
b = set(b)

d = a & b

print(d)
